import React from "react";
import Header from "../Components/Header";
import Footer from "../Components/Footer";
import Home from "../Components/Home";
import Welcome from "../Components/Welcome";
import About from "../Components/About";
import Projects from "../Components/Projects";
import Service from "../Components/Service";

const ArabicPage = () => {
  document.getElementsByTagName("html")[0].dir = "rtl";
  return (
    <>
      <Header
        home="الرئيسيه"
        contact="تواصل معنا"
        work="اعمالنا"
        service="خدماتنا"
        about="المزيد"
      />
      <Home
        t1="الخبراء يحولون فكرتك إلى منتج"
        t2="الاستفادة من التقنيات المتطورة"
        t3="نقوم بتطوير حلول برمجية مصممة خصيصًا لمنصات الويب والهواتف المحمولة."
        b="استكشاف المزيد"
      />
      <Welcome
        t1="مرحباً!"
        t2="شريكك الأول لحلول تطوير البرمجيات"
        t3={[" من اجل", " الويب ", " و", " تطبيق الجوال ", " تطوير"]}
        p={`مرحبا في عالمنا! نحن تطبيق متخصص على الويب والجوال
           شركة تطوير وتطوير البرمجيات تقدم مصممة خصيصا
           حلول. بدءًا من تصميم تطبيقات الويب والهواتف المحمولة الاستثنائية للشركات الناشئة،
           الشركات، نحن هنا لتحويل الأفكار المبتكرة إلى واقع ملموس. مع
           فرق الخبراء لدينا تقود هذه المهمة، ونحن نقدم خلفية شاملة
           وتطوير الواجهة الأمامية`}
        b="تعرف علينا أكثر"
      />
      <About
        secTitle=" من نحن"
        p1="تس اس هي شركة رائدة في مجال تطوير الويب وتطبيقات الهاتف المحمول في مصر، تقدم حلولاً مبتكرة وعصرية تلبي احتياجات عملائها. نحن نستخدم أحدث التقنيات والمعايير لتصميم مواقع وتطبيقات سهلة الاستخدام وسريعة الأداء وآمنة ومتوافقة مع محركات البحث."
        p2={`لدينا فريق من المهندسين المتخصصين والخبراء في مجال SEO، يعملون بجد لتقديم أفضل الخدمات والدعم لعملائنا. نهتم برضا عملائنا ونسعى لبناء علاقات طويلة الأمد معهم. نقدم استشارات مجانية وتحليلات شاملة لمشاريعكم ونقترح الحلول المناسبة لأهدافكم. إذا كنت تبحث عن شركة موثوقة ومحترفة لتصميم موقعك أو تطبيقك، فلا تترد في الاتصال بنا.`}
        p3="إذا كنت تبحث عن شركة موثوقة ومحترفة لتصميم موقعك أو تطبيقك، فلا تتردد في الاتصال بنا. "
        p4="بفضل تعاونك مع شركة تس اس ، ستجد الحل الأمثل لاحتياجاتك في مجال تطوير تطبيقات الويب وتصميم تطبيقات الهواتف المحمولة, لنضمن لك أقصى قدر من التميز والرؤية العصرية."
        p5="فخورون بتميزنا كواحدة من أفضل شركات البرمجة في مصر، حيث نقدم حلولًا متميزة ومبتكرة في عالم تصميم وتطوير التطبيقات والمواقع الإلكترونية. يمتلك فريقنا المتخصص خبرة واسعة في مجالات البرمجة والتصميم، مما يجعلنا قادرين على تلبية متطلبات عملائنا بكفاءة ودقة عالية."
        t2="&nbsp;تصميم مواقع الويب"
        p6="في تس اس، نؤمن بأن تصميم المواقع يجب أن يكون شاملاً واحترافيًا. نقدم خدمات تصميم مواقع الويب التي تتميز بالجمالية والوظائف القوية والتجربة الرائعة للمستخدمين. سواء كنت تبحث عن موقع لشركتك التجارية أو لمشروعك الشخصي، فإننا هنا لتحقيق رؤيتك وجعلها واقعًا ملموسًا على الإنترنت."
        t3="&nbsp;	تصميم تطبيقات الهواتف المحمولة"
        p7="نقدم أيضًا خدمات تصميم تطبيقات الهواتف المحمولة بأحدث التقنيات والأساليب الإبداعية. نضمن لك تجربة مستخدم رائعة وواجهة مستخدم سهلة الاستخدام، مما يجعل تطبيقك يبرز بين منافسيه ويحقق نجاحًا كبيرًا على المنصات الرقمية."
        t4="&nbsp;لماذا شركة تي اس ؟"
        p8={`	
شركة تي اس واحدة من أكبر شركات البرمجة في مصر. وتتمتع بسمعة ممتازة كواحدة من أفضل شركات السوفت وير على الإطلاق، حيث تتبوأ مكانة مرموقة بين أكبر شركات السوفت وير على مستوى العالم.
`}
        border="border-end pe-2"
        secStyle={"sec-title2 text-end me-4"}
      />
      <Projects
        secTitle="مشاريعنا"
        p1="يقدم الموقع الإلكتروني حلاً شاملاً لأصحاب القوارب للحفاظ على سفنهم في أفضل حالة. من خلال التنقل سهل الاستخدام والتصميم البديهي، يوفر موقع الويب معلومات حول خدمات غسيل القوارب"
        p2="يوفر موقع الويب منصة للعملاء للتعرف عليها
                 الخدمات المتاحة مع واجهة سهلة الاستخدام وسريعة الاستجابة
                 التصميم، يهدف الموقع إلى تبسيط عملية غسيل السيارات"
        p3="يقدم الموقع خدمات شاملة لتنظيف الطائرات وتفصيلها لضمان أعلى معايير النظافة لشركات الطيران ومشغلي الطائرات الخاصة. من خلال واجهة سهلة الاستخدام، يوفر الموقع معلومات مفصلة حول مجموعة الخدمات المقدمة"
        message="استكشاف المزيد"
      />
      <Service
        secTitle="خدماتنا"
        p1={`يركز على خلق بديهية، وجذابة بصريا، وسلس
               التفاعلات بين المستخدمين والمنتجات أو الخدمات الرقمية.`}
        p2="إنشاء تطبيقات برمجية لمنصات مختلفة مثل الأجهزة المحمولة أو أجهزة الكمبيوتر المكتبية أو متصفحات الويب."
        p3="تتضمن عملية إنشاء وتطوير منتجات مادية أو رقمية تلبي احتياجات ورغبات المستخدمين وتتوافق أيضًا مع أهداف العمل."
        p4="عملية منهجية تضمن تلبية المنتجات أو الخدمات للمتطلبات والمعايير المحددة."
      />

      <Footer
        secTitle="اتصل بنا"
        title1="ابقى على تواصل"
        title2="راسلنا"
        description="ابق على تواصل معنا دائمًا عبر البريد الإلكتروني أو الواتساب ونحن
                 سوف نقوم بالرد عليك في أقرب وقت ممكن."
        building="اسم المشروع"
        buildingDesc="طيبة سويس جي إم بي إتش"
        location="الوقع"
        locationDesc="Poststrasse 17، 2504 بيل/بيان، سويسرا"
        placeholder1="الاسم"
        placeholder2="الموضوع"
        placeholder3="الرساله"
        submit="ارسل"
        mail="الايميل"
      />
    </>
  );
};

export default ArabicPage;
